revk/ESP32-Flasher/main/Flasher.c
// Flasher
// See https://components.espressif.com/components/espressif/esp-serial-flasher/versions/1.3.1/examples/esp32_usb_cdc_acm_example?language=en

static const char TAG[] = "Flasher";

#include "revk.h"
#include "esp_sleep.h"
#include "esp_task_wdt.h"
#include <netdb.h>
#include <driver/gpio.h>
#include <driver/uart.h>
#include <driver/rtc_io.h>
#include <driver/sdmmc_host.h>
#include <sdmmc_cmd.h>
#include "esp_http_client.h"
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include "esp_crt_bundle.h"
#endif
#include "esp_vfs_fat.h"
#include <sys/dirent.h>
#include "usb/usb_host.h"
#include "usb/cdc_acm_host.h"
#include "esp_loader.h"
#include "esp32_usb_cdc_acm_port.h"
#include <math.h>
#include <mbedtls/sha1.h>

struct
{
   uint8_t die:1;               // Shutdown
   uint8_t wifi:1;              // WiFi connected
   uint8_t reload:1;            // Re load manifest, etc
   uint8_t forceerase:1;        // Force erase
   uint8_t voltage3v3:1;        // 3.3V not 5V
   uint8_t erase:1;             // Manifest says erase
   uint8_t nobtn:1;             // Disable button erase
   uint8_t nocheck:1;           // Disable check
   uint8_t connected:1;         // Connected
   uint8_t fileerror:1;         // File error
   uint8_t checked:1;           // Upgrade checked
   uint8_t manifestappprefix:1; // manifestapp is prefix
} volatile b;
uint16_t manifests = 0;         // Bit map of manifests on SD
uint8_t progress = 0;           // Progress (LED)
char ledf = 'K',
   ledt = 'K',
   ledsd = 'B';                 // LED from/to and SD
uint8_t mac[6] = { 0 };         // Found mac
char chip[30] = { 0 };          // Found chip type

uint32_t badusb = 0;            // Last devices 0 even

uint32_t flashsize = 0;         // Found flash size

char *manifestjson = NULL;      // Loaded manifest JSON
uint32_t manifestsize = 0;      // Total flash bytes
jo_t j = NULL;                  // Parsed manifest JSON
#define	fields				\
	x (app);			\
	x (version);			\
	x (build);			\
	x (setting);			\
	x (start);			\
	x (pass);			\
	x (fail);			\
	xx(wifi,ssid);			\
	xx(wifi,pass);			\

#define x(f)	char *manifest##f=NULL;
#define xx(f1,f2)	char *manifest##f1##f2=NULL;
fields
#undef	x
#undef	xx
#define	BLOCK	4096
   uint8_t block[BLOCK];

#ifdef  CONFIG_TINYUSB_MSC_MOUNT_PATH
const char sd_dir[] = CONFIG_TINYUSB_MSC_MOUNT_PATH;
#else
const char sd_dir[] = "/sd";
#endif


led_strip_handle_t strip = NULL;

const char *
mqtt_client_callback (int client, const char *prefix, const char *target, const char *suffix, jo_t j)
{
   if (client || !prefix || target || strcmp (prefix, topiccommand) || !suffix)
      return NULL;              // Not for us or not a command from main MQTTS
   if (!strcmp (suffix, "wifi"))
      b.wifi = 1;
   return NULL;
}

void
led_task (void *arg)
{
   if (strip)
   {
      uint8_t tick = 0;
      while (!b.die)
      {
         tick++;
         uint32_t f = revk_rgb (ledf);
         uint32_t t = revk_rgb (ledt);
         uint8_t p = progress;
         if (f != t && p < 5)
            p = 5;              // don't do all off
         for (int i = 0; i < 10; i++)
         {
            uint8_t l = p;
            if (l > 10)
               l = 10;
            p -= l;
            if ((b.fileerror && (tick & 1)) || (f == t && i != progress / 10))
               led_strip_set_pixel (strip, i, 0, 0, 0); // Off
            else
               led_strip_set_pixel (strip, i,   //
                                    gamma8[l * ((t >> 16) & 255) / 10 + (10 - l) * ((f >> 16) & 255) / 10],     //
                                    gamma8[l * ((t >> 8) & 255) / 10 + (10 - l) * ((f >> 8) & 255) / 10],       //
                                    gamma8[l * ((t >> 0) & 255) / 10 + (10 - l) * ((f >> 0) & 255) / 10]);
         }
         if (b.fileerror && !(tick & 1))
            revk_led (strip, 10, 255, revk_rgb ('R'));
         else
            revk_led (strip, 10, 255, revk_rgb (ledsd));
         REVK_ERR_CHECK (led_strip_refresh (strip));
         usleep (100000);
      }
      for (int i = 0; i < 11; i++)
         revk_led (strip, i, 0, 0);
      REVK_ERR_CHECK (led_strip_refresh (strip));
   }
   vTaskDelete (NULL);
}

void
set_led (uint8_t p, char f, char t)
{                               // Set LED display state (if f==t then one LED at progress point)
   progress = p;
   if (f)
      ledf = f;
   if (t)
      ledt = t;
   //ESP_LOGE (TAG, "LED %c %c %d%%", ledf, ledt, progress);
}

void
btn_task (void *arg)
{
   if (btn.set)
   {
      while (!b.die)
      {
         if (revk_gpio_get (btn))
         {
            if (b.connected)
            {
               if (!b.nobtn)
               {
                  b.forceerase = 1;
                  b.reload = 1;
               }
            } else if (manifests)
            {
               uint8_t m = manifest;
               do
               {
                  m++;
                  if (m == 10)
                     m = 0;
               }
               while (!(manifests & (1 << m)));
               if (m != manifest)
               {
                  jo_t j = jo_object_alloc ();
                  jo_int (j, "manifest", m);
                  revk_setting (j);
                  jo_free (&j);
                  b.checked = 0;
                  b.reload = 1;
               }
            }
            while (revk_gpio_get (btn))
               usleep (100000);
            continue;
         }
         usleep (100000);
      }
   }
   vTaskDelete (NULL);
}

static void
usb_lib_task (void *arg)
{
   while (1)
   {
      uint32_t event_flags;
      usb_host_lib_handle_events (portMAX_DELAY, &event_flags);
      if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS)
         usb_host_device_free_all ();
      if (!event_flags)
      {
         usb_host_lib_info_t i;
         usb_host_lib_info (&i);
         if (i.num_devices)
            badusb = 0;
         else
            badusb = uptime ();
      }
   }
}

void
host_error_cb (void)
{
   ESP_LOGE (TAG, "Host error");
}

void
device_disconnect_cb (void)
{
   ESP_LOGE (TAG, "Device disconnect");
   b.connected = 0;
}

void
device_connect_cb (usb_device_handle_t usb_dev)
{
   ESP_LOGE (TAG, "Device connect");
   b.connected = 1;
}

void
apply_settings ()
{
   char buf[266];
   loader_port_write ((uint8_t *) "\n", 1, 2000);
   if (manifestsetting)
   {
      ESP_LOGE (TAG, "Setting %s", manifestsetting);
      loader_port_write ((uint8_t *) manifestsetting, strlen (manifestsetting), 2000);
   }
   if (manifestwifissid)
   {                            // IMPROV https://www.improv-wifi.com/serial/
      char *e;
      uint8_t c;
      // ID
      e = buf;
      e = stpcpy (e, "IMPROV");
      *e++ = 1;                 // Version
      *e++ = 3;                 // Command RPC
      e++;                      // Len
      *e++ = 3;                 // ID command
      *e++ = 0;                 // Command len
      buf[8] = (e - (buf + 9)); // Set len
      c = 0;                    // Checksum
      for (uint8_t * q = (uint8_t *) buf; q < (uint8_t *) e; q++)
         c += *q;
      *e++ = c;
      loader_port_write ((uint8_t *) buf, e - buf, 2000);
      ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV", buf, e - buf, ESP_LOG_INFO);
      // WiFI
      e = buf;
      e = stpcpy (e, "IMPROV");
      *e++ = 1;                 // Version
      *e++ = 3;                 // Command RPC
      e++;                      // Len
      *e++ = 1;                 // WiFi command
      e++;                      // Command len
      *e++ = strlen (manifestwifissid);
      e = stpcpy (e, manifestwifissid);
      if (manifestwifipass)
      {
         *e++ = strlen (manifestwifipass);
         e = stpcpy (e, manifestwifipass);
      }
      buf[10] = (e - (buf + 11));       // Set cmd len
      buf[8] = (e - (buf + 9)); // Set len
      c = 0;                    // Checksum
      for (uint8_t * q = (uint8_t *) buf; q < (uint8_t *) e; q++)
         c += *q;
      *e++ = c;
      loader_port_write ((uint8_t *) buf, e - buf, 2000);
      ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV", buf, e - buf, ESP_LOG_INFO);
   }
}

enum
{
   STATUS_ERROR,                // error
   STATUS_SILENT,               // no data
   STATUS_EMPTY,                // 0xffffffff error
   STATUS_LOOPING,              // Starting multiple times
   STATUS_FAIL,                 // ATE: FAIL
   STATUS_PASS,                 // ATE: PASS
   STATUS_MISMATCH,             // Code needs flashing as version mismatch
   STATUS_TIMEOUT,              // Not looping but not pass/fail
} target_status (void)
{
#define	WAIT	10
   uint32_t to = uptime () + WAIT;
   uint8_t rst = 0;
   int8_t ate = 0;
   int8_t match = 0;
   char ok = !manifestsetting;
   char buf[266];               // Enough for IMRPOV
   uint32_t p = 0;
   jo_t j = NULL;
   uint8_t status = STATUS_TIMEOUT;
   while (uptime () <= to && status == STATUS_TIMEOUT)
   {
      uint8_t c;
      esp_loader_error_t e = loader_port_read (&c, 1, 100);
      if (e == ESP_LOADER_ERROR_TIMEOUT)
      {
         if (ate && ok)
            break;
         continue;
      }
      if (e)
         return STATUS_ERROR;
      if (!j && !p && c == '{')
         j = jo_create_alloc ();
      if (j && jo_char (j, c) > 0)
         continue;
      if (!j && p >= 6 && !strncmp (buf, "IMPROV", 6))
      {
         if (p < sizeof (buf) - 1)
            buf[p++] = c;
         if (p < 8 || p < buf[8] + 10)
            continue;
      } else if (!j && c >= ' ')
      {
         if (p < sizeof (buf) - 1)
            buf[p++] = c;
         continue;
      }
      if (!j && !p)
         continue;
      void do_start (void)
      {
         if (rst++ > 5)
            status = STATUS_LOOPING;
         apply_settings ();
      }
      if (p)
      {                         // String
         buf[p] = 0;
         if (!strncmp (buf, "IMPROV", 6))
         {
            if (p < 9)
               ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV (len error)", buf, p, ESP_LOG_ERROR);
            else if (buf[6] != 1)
               ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV (ver error)", buf, p, ESP_LOG_ERROR);
            else
            {
               uint8_t c = 0;
               for (uint8_t * q = (uint8_t *) buf; q < (uint8_t *) buf + p - 1; q++)
                  c += *q;
               if (c != buf[p - 1])
                  ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV (checksum error)", buf, p, ESP_LOG_ERROR);
               else
               {
                  ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV", buf, p, ESP_LOG_INFO);
                  if (buf[7] == 1 && buf[8] == 1)
                  {             // Current state
                     if (buf[9] == 2)
                        ESP_LOGE ("IMPROV", "Ready");
                     if (buf[9] == 3)
                        ESP_LOGE ("IMPROV", "Provisioning");
                     if (buf[9] == 4)
                     {
                        ESP_LOGE ("IMPROV", "Provisioned");
                        ok = 1;
                        if (!manifestpass)
                           ate = 1;
                     }
                  } else if (buf[7] == 2 && buf[8] == 1)
                     ESP_LOGE ("IMPROV", "Error %d", buf[9]);
                  else if (buf[7] == 4)
                  {             // RPC response
                     int q = 11;
                     int n = 0;
                     while (q + buf[q] + 1 < p)
                     {
                        ESP_LOGE ("IMPROV", "%.*s", buf[q], buf + q + 1);
                        if (buf[9] == 3)
                        {       // ID check
                           if (n == 0 && manifestapp && strncmp (buf + q + 1, manifestapp, buf[q]))
                           {
                              ESP_LOGE (TAG, "App expected %s", manifestapp);
                              status = STATUS_ERROR;
                           }
                           if (n == 3 && manifestversion)
                           {
                              if (!strncmp (buf + q + 1, manifestversion, buf[q]))
                              {
                                 if (match >= 0)
                                    match = 1;
                              } else
                              {
                                 match = -1;
                                 ESP_LOGE (TAG, "Version expected %s", manifestversion);
                              }
                           }
                           if (n == 1 && manifestbuild)
                           {
                              if (!strncmp (buf + q + 1, manifestbuild, buf[q]))
                              {
                                 if (match >= 0)
                                    match = 1;
                              } else
                              {
                                 match = -1;
                                 ESP_LOGE (TAG, "Version expected %s", manifestbuild);
                              }
                           }
                        }
                        q += buf[q] + 1;
                        n++;
                     }
                  } else
                     ESP_LOG_BUFFER_HEX_LEVEL ("IMPROV (unknown)", buf, p, ESP_LOG_ERROR);
               }
            }
            p = 0;
         } else if (!strncmp (buf, "SPIWP:", 6))
         {
            to = uptime () + WAIT;
            ok = !manifestsetting;
            if (rst++ > 5)
               return STATUS_LOOPING;
         } else if (manifeststart && !strcmp (buf, manifeststart))
            do_start ();
         else if (manifestpass && !strcmp (buf, manifestpass))
            ate = 1;
         else if (manifestfail && !strcmp (buf, manifestfail))
            ate = -1;
         else if (!strcmp (buf, "invalid header: 0xffffffff"))
            return STATUS_EMPTY;
         else
            p = 0;
         if (p)
            printf ("\033[1;34m%s\033[0m\n", buf);
         p = 0;
      } else if (j)
      {                         // JSON
         jo_skip (j);           // Check errors
         const char *e = jo_error (j, NULL);
         if (e)
            ESP_LOGE (TAG, "JSON Error: %s", e);
         else
         {
            jo_type_t t;
            if ((t = jo_find (j, "ate")))
            {
               if (t == JO_TRUE)
                  ate = 1;
               else if (t == JO_FALSE)
                  ate = -1;
            } else if ((t = jo_find (j, "app")))
            {
               if (rst++ > 5)
                  status = STATUS_LOOPING;
               else
               {
                  to = uptime () + WAIT;
                  if (t == JO_STRING && manifestapp
                      && (b.manifestappprefix ? jo_strncmp (j, manifestapp, strlen (manifestapp)) : jo_strcmp (j, manifestapp)))
                  {
                     ESP_LOGE (TAG, "App expected %s", manifestapp);
                     status = STATUS_ERROR;
                  } else
                  {
                     if (match >= 0 && (t = jo_find (j, "version")) == JO_STRING && manifestversion)
                     {
                        if (!jo_strcmp (j, manifestversion))
                           match++;
                        else
                        {
                           match = -1;
                           ESP_LOGE (TAG, "Version expected %s", manifestversion);
                        }
                     }
                     if (match >= 0 && (t = jo_find (j, "build")) == JO_STRING && manifestbuild)
                     {
                        if (!jo_strcmp (j, manifestbuild))
                           match++;
                        else
                        {
                           match = -1;
                           ESP_LOGE (TAG, "Build expected %s", manifestbuild);
                        }
                     }
                     if (match >= 0)
                        do_start ();
                  }
               }
            } else if ((t = jo_find (j, "ok")))
            {
               if (t == JO_TRUE)
                  ok = 1;
               else if (t == JO_FALSE)
                  status = STATUS_ERROR;
            }
         }
         // Check JSON match
         char *s = jo_finisha (&j);
         printf ("\033[1;34m%s\033[0m\n", s);
         if (manifeststart && !strcmp (s, manifeststart))
            do_start ();
         if (manifestpass && !strcmp (s, manifestpass))
            ate = 1;
         if (manifestfail && !strcmp (s, manifestfail))
            ate = -1;
         free (s);
      }
   }
   if (match < 0)
      return STATUS_MISMATCH;
   if (!rst)
      return STATUS_SILENT;
   if (ate > 0)
      return STATUS_PASS;
   if (ate < 0)
      return STATUS_FAIL;
   return status;
};

void
chip_info (void)
{                               // Get chip info
   const char *const chips[] = { "ESP8266", "ESP32", "ESP32S2", "ESP32C3", "ESP32S3", "ESP32C2",
      "ESP32C5", "ESP32H2", "ESP32C6", "ESP32P4", "ESP_MAX",
      "ESP_UNKNOWN"
   };
   char *c = chip;
   *c = 0;
   target_chip_t id = esp_loader_get_target ();
   if (id < sizeof (chips) / sizeof (*chips))
      c = stpcpy (c, chips[id]);
   uint8_t psram = 0;
   switch (id)
   {
   case ESP32S3_CHIP:
      {                         // We can get some more info...
         c = stpcpy (c, "MC");  // Always MC
         const uint32_t efuse = 0x60007000;
         const uint32_t block1 = efuse + 0x44;
         uint32_t r1,
           r2;
         if (!esp_loader_read_register (block1 + 12, &r1))
         {
            r1 = (r1 >> 21) & 7;
            if (r1 == 1)
               c = stpcpy (c, "PICO");
         }
         if (!esp_loader_read_register (block1 + 16, &r1) && !esp_loader_read_register (block1 + 20, &r2))
            psram = ((r1 >> 3) & 3) | ((r2 >> 17) & 4);
         break;
      }
   default:
      break;                    // Other chip types may be needed
   }
   flashsize = 0;
   if (!esp_loader_flash_detect_size (&flashsize) && flashsize)
      c += sprintf (c, "N%u", (uint8_t) (flashsize / 1024 / 1024));
   if (psram)
      c += sprintf (c, "R%u", psram);
   *c = 0;
   if (b.connected && !esp_loader_read_mac (mac))
      ESP_LOGE (TAG, "Chip %02X:%02X:%02X:%02X:%02X:%02X %s", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], chip);
}

void
close_manifest (void)
{
   if (!manifestjson)
      return;
   jo_free (&j);
   free (manifestjson);
   manifestjson = NULL;
}

typedef void manifest_t (char *fn, char *url, int app, uint32_t address, uint32_t size, uint8_t verify);

void
scan_manifest (manifest_t cb)
{
   if (!j)
      return;
   jo_rewind (j);
   if (jo_find (j, "flash") == JO_ARRAY)
   {
      while (jo_next (j) == JO_OBJECT)
      {
         uint32_t address = 0;
         char *filename = NULL;
         char *url = NULL;
         int app = -1;
         uint8_t verify = flashverify;
         while (jo_next (j) == JO_TAG)
         {
            if (!jo_strcmp (j, "filename") && !filename)
            {
               if (jo_next (j) == JO_STRING)
                  filename = jo_strdup (j);
            } else if (!jo_strcmp (j, "url") && !url)
            {
               if (jo_next (j) == JO_STRING)
                  url = jo_strdup (j);
            } else if (!jo_strcmp (j, "app") && app < 0)
            {
               jo_type_t t = jo_next (j);
               if (t == JO_NUMBER)
                  app = jo_read_int (j);
               else if (t == JO_TRUE)
                  app = 32;
            } else if (!jo_strcmp (j, "address"))
            {
               jo_type_t t = jo_next (j);
               if (t == JO_NUMBER)
                  address = jo_read_int (j);
               else if (t == JO_STRING)
               {
                  char *a = jo_strdup (j);
                  address = strtoul (a, NULL, 16);
                  free (a);
               }
            } else if (!jo_strcmp (j, "verify"))
            {
               jo_type_t t = jo_next (j);
               if (t == JO_FALSE)
                  verify = 0;
               else if (t == JO_TRUE)
                  verify = 1;
               else if (t == JO_NUMBER)
                  verify = jo_read_int (j);
            } else
               jo_next (j);
         }
         if (!filename && url)
         {                      // Use hash
            const char *leaf = strrchr (url, '/');
            if (leaf && strlen (leaf) > 200)
               leaf = strrchr (url, '.');
            else if (leaf)
               leaf++;
            if (!leaf || strlen (leaf) > 200)
               leaf = "";
            unsigned char output[20];
            mbedtls_sha1 ((const uint8_t *) url, strlen (url), output);
            if ((filename = malloc (40 + 1 + strlen (leaf) + 1)))
            {
               for (int i = 0; i < 20; i++)
                  sprintf (filename + i * 2, "%02X", output[i]);
               filename[40] = '-';
               strcpy (filename + 41, leaf);
            }
         }
         if (filename)
         {
            char *fn = NULL;
            if (asprintf (&fn, "%s/%s", sd_dir, filename) >= 0)
            {
               struct stat s = { 0 };
               if (stat (fn, &s))
                  s.st_size = 0;
               cb (fn, url, app, address, s.st_size, verify);
               free (fn);
            }
         } else if (cb)
            cb (NULL, url, app, address, 0, verify);
         free (filename);
         free (url);
      }
   }
}

